var pragTwo = [

    "اللهم استرنا فوق الارض وتحت الارض ويوم العرض عليك",
    "اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك خاصمت، وبك حاكمت، فاغفر لي ما قدمت وما أخرت، وأسررت وأعلنت، وما أنت أعلم به مني، لا إله إلا أنت ",
    " سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي ",
    "اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك وارحمني، إنك أنت الغفور الرحيم",
    "اللهم إني أعوذ بعظمتك أن أغتال من تحتي",
    "اللهم إني أعوذ بك من العجز والكسل، والجبن والهرم والبخل ، وأعوذ بك من عذاب القبر ومن فتنة المحيا والممات ",
    "اللهم إني أعوذ بك من شر ما عملت، ومن شر ما لم أعمل",
    "اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك وفجاءة نقمتك، وجميع سخطك",
    "اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي",
    " رب اغفرلي وارحمني وتب علي"

];

var pragOne = [

    "قال رسول الله صلى الله عليه وسلم: (إِذَا مَاتَ الإنْسَانُ انْقَطَعَ عنْه عَمَلُهُ إِلَّا مِن ثَلَاثَةٍ: إِلَّا مِن صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو له)",
    "عن جابر بن عبد الله -رضي الله عنه- قال: قال رسول الله صلّى الله عليه وسلم: (سلُوا اللهَ علمًا نافعًا، وتَعَوَّذُوا باللهِ منْ علمٍ لا ينفعُ)",
    "قال الرّسول -صلّى الله عليه وسلّم-: (من كانتِ الآخرةُ هَمَّهُ جعلَ اللَّهُ غناهُ في قلبِهِ وجمعَ لَه شملَهُ وأتتهُ الدُّنيا وَهيَ راغمة، ومن كانتِ الدُّنيا همَّهُ جعلَ اللَّهُ فقرَهُ بينَ عينيهِ وفرَّقَ عليهِ شملَهُ، ولم يأتِهِ منَ الدُّنيا إلَّا ما قُدِّرَ لَهُ)",
    "قال الرّسول -صلّى الله عليه وسلّم-: (لو كانتِ الدُّنيا تعدلُ عندَ اللهِ جناحَ بعوضةٍ ما سقى كافرًا منها شربةَ ماءٍ)",
    "قال رسول الله -صلّى الله عليه وسلّم -: (لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ)",
    "قال الرّسول -صلّى الله عليه وسلّم-: (مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فلا يُؤْذِ جارَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ)",
    "قال الرّسول -صلّى الله عليه وسلّم-: (ما شيءٌ أثقلُ في ميزانِ المؤمِنِ يومَ القيامةِ مِن خُلُقٍ حسَنٍ، فإنَّ اللَّهَ تعالى ليُبغِضُ الفاحشَ البَذيءَ)",
    "قال الرّسول -صلّى الله عليه وسلّم-: (إذا أحبَّ الرجلُ أخاه فلْيخبره أنّه يحبُّه)",
    "قال الرّسول -صلّى الله عليه وسلّم-: (إنَّ صاحبَ حُسنِ الخلقِ ليبلُغُ بِهِ درجةَ صاحبِ الصَّومِ والصَّلاةِ)",
    " قال الرّسول -صلّى الله عليه وسلّم-: (ما يُصِيبُ المُؤْمِنَ مِن وصَبٍ، ولا نَصَبٍ، ولا سَقَمٍ، ولا حَزَنٍ حتَّى الهَمِّ يُهَمُّهُ، إلَّا كُفِّرَ به مِن سَيِّئاتِهِ)"


];

var indeexOne = 0
var indeexTwo = 0

function buttonP() {
    var contentOne
    contentOne = Math.ceil(Math.random() * pragOne.length);
    while (indeexOne == contentOne) {
        contentOne = Math.ceil(Math.random() * pragOne.length);
    }

    document.getElementById("pOne").innerHTML = pragOne[contentOne - 1];
    document.getElementById("pOne").classList.replace("d-none", "d-block");
    document.getElementById("pTwo").classList.replace("d-block", "d-none");
    indeexOne = contentOne


}

function buttonC() {
    var contentTwo
    contentTwo = Math.ceil(Math.random() * pragTwo.length);
    while (indeexTwo == contentTwo) {
        contentTwo = Math.ceil(Math.random() * pragTwo.length);
    }
    document.getElementById("pTwo").innerHTML = pragTwo[contentTwo - 1];
    document.getElementById("pTwo").classList.replace("d-none", "d-block");
    document.getElementById("pOne").classList.replace("d-block", "d-none");
    indeexTwo = contentTwo
}